# GetCurrent Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeIterator..::..GetCurrent Method
ConduitSizeIterator Class See Also
---
Returns the current ConduitSize.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ConduitSize GetCurrent()
```

Visual Basic
---
```text
Public Function GetCurrent As ConduitSize
```

Visual C++
---
```text
public:
ConduitSize^ GetCurrent()
```

# ### Return Value
The current ConduitSize.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace